telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
    s_shield_mag_ready = false;
    s_shield_baro_ready = false;
    s_shield_sht_ready = false;
    s_shield_stts_ready = false;
    s_shield_mag_use_shub = false;
    s_shield_baro_use_shub = false;
    s_shield_stts_use_shub = false;
    s_shield_mag_use_touch_bus = true;
    s_shield_mag_addr = SHIELD_LIS2MDL_ADDR;
    s_shield_baro_use_touch_bus = true;
    s_shield_sht_use_touch_bus = true;
    s_shield_stts_use_touch_bus = true;
    s_shield_baro_addr = 0u;
    s_shield_sht_addr = 0u;
    s_shield_stts_addr = 0u;

    for (uint32_t bi = 0u; bi < 2u; bi++)
    {
        if (ShieldBusRead(buses[bi], SHIELD_LIS2MDL_ADDR, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u) &&
            (who == SHIELD_LIS2MDL_WHOAMI))
        {
            s_shield_mag_use_touch_bus = buses[bi];
            s_shield_mag_addr = SHIELD_LIS2MDL_ADDR;
            s_shield_mag_ready = true;
            break;
        }
        if (ShieldBusRead(buses[bi], SHIELD_LIS2MDL_ADDR_ALT, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u) &&
            (who == SHIELD_LIS2MDL_WHOAMI))
        {
            s_shield_mag_use_touch_bus = buses[bi];
            s_shield_mag_addr = SHIELD_LIS2MDL_ADDR_ALT;
            s_shield_mag_ready = true;
            break;
        }
    }
    if (!s_shield_mag_ready && s_shield_gyro_ready && (s_shield_gyro_who == SHIELD_IMU_WHOAMI_LSM6DSO16IS))
    {
        if (ShieldShubReadRegs(SHIELD_LIS2MDL_ADDR, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u) &&
            (who == SHIELD_LIS2MDL_WHOAMI))
        {
            s_shield_mag_addr = SHIELD_LIS2MDL_ADDR;
            s_shield_mag_ready = true;
            s_shield_mag_use_shub = true;
        }
        else if (ShieldShubReadRegs(SHIELD_LIS2MDL_ADDR_ALT, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u) &&
                 (who == SHIELD_LIS2MDL_WHOAMI))
        {
            s_shield_mag_addr = SHIELD_LIS2MDL_ADDR_ALT;
            s_shield_mag_ready = true;
            s_shield_mag_use_shub = true;
        }
    }

    if (s_shield_mag_ready)
    {
        if (s_shield_mag_use_shub)
        {
            (void)ShieldShubWriteReg(s_shield_mag_addr, SHIELD_LIS2MDL_REG_CFG_A, 0x00u);
            (void)ShieldShubWriteReg(s_shield_mag_addr, SHIELD_LIS2MDL_REG_CFG_C, 0x10u);
            PRINTF("SHIELD_MAG ready bus=SHUB addr=0x%02x\r\n", (unsigned int)s_shield_mag_addr);
        }
        else
        {
            (void)ShieldBusWriteReg(s_shield_mag_use_touch_bus, s_shield_mag_addr, SHIELD_LIS2MDL_REG_CFG_A, 0x00u);
            (void)ShieldBusWriteReg(s_shield_mag_use_touch_bus, s_shield_mag_addr, SHIELD_LIS2MDL_REG_CFG_C, 0x10u);
            PRINTF("SHIELD_MAG ready bus=%s addr=0x%02x\r\n",
                   s_shield_mag_use_touch_bus ? bus_name[0] : bus_name[1],
                   (unsigned int)s_shield_mag_addr);
        }
    }

    for (uint32_t bi = 0u; bi < 2u; bi++)
    {
        if (ShieldBusRead(buses[bi], SHIELD_LPS22DF_ADDR0, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) &&
            (who == SHIELD_LPS22DF_WHOAMI))
        {
            s_shield_baro_addr = SHIELD_LPS22DF_ADDR0;
            s_shield_baro_use_touch_bus = buses[bi];
            break;
        }
        if (ShieldBusRead(buses[bi], SHIELD_LPS22DF_ADDR1, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) &&
            (who == SHIELD_LPS22DF_WHOAMI))
        {
            s_shield_baro_addr = SHIELD_LPS22DF_ADDR1;
            s_shield_baro_use_touch_bus = buses[bi];
            break;
        }
    }
    if ((s_shield_baro_addr == 0u) && s_shield_gyro_ready && (s_shield_gyro_who == SHIELD_IMU_WHOAMI_LSM6DSO16IS))
    {
        if (ShieldShubReadRegs(SHIELD_LPS22DF_ADDR0, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) &&
            (who == SHIELD_LPS22DF_WHOAMI))
        {
            s_shield_baro_addr = SHIELD_LPS22DF_ADDR0;
            s_shield_baro_use_shub = true;
        }
        else if (ShieldShubReadRegs(SHIELD_LPS22DF_ADDR1, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) &&
                 (who == SHIELD_LPS22DF_WHOAMI))
        {
            s_shield_baro_addr = SHIELD_LPS22DF_ADDR1;
            s_shield_baro_use_shub = true;
        }
    }

    if (s_shield_baro_addr != 0u)
    {
        if (s_shield_baro_use_shub)
        {
            (void)ShieldShubWriteReg(s_shield_baro_addr, SHIELD_LPS22DF_REG_CTRL1, 0x22u);
        }
        else
        {
            (void)ShieldBusWriteReg(s_shield_baro_use_touch_bus, s_shield_baro_addr, SHIELD_LPS22DF_REG_CTRL1, 0x22u);
        }
        s_shield_baro_ready = true;
        if (s_shield_baro_use_shub)
        {
            PRINTF("SHIELD_BARO ready bus=SHUB addr=0x%02x\r\n", (unsigned int)s_shield_baro_addr);
        }
        else
        {
            PRINTF("SHIELD_BARO ready bus=%s addr=0x%02x\r\n",
                   s_shield_baro_use_touch_bus ? bus_name[0] : bus_name[1],
                   (unsigned int)s_shield_baro_addr);
        }
    }

    for (uint32_t bi = 0u; bi < 2u; bi++)
    {
        if (ShieldBusProbeAddress(buses[bi], SHIELD_SHT40_ADDR0))
        {
            s_shield_sht_addr = SHIELD_SHT40_ADDR0;
            s_shield_sht_use_touch_bus = buses[bi];
            break;
        }
        if (ShieldBusProbeAddress(buses[bi], SHIELD_SHT40_ADDR1))
        {
            s_shield_sht_addr = SHIELD_SHT40_ADDR1;
            s_shield_sht_use_touch_bus = buses[bi];
            break;
        }
    }
    if (s_shield_sht_addr != 0u)
    {
        s_shield_sht_ready = true;
        PRINTF("SHIELD_SHT ready bus=%s addr=0x%02x\r\n",
               s_shield_sht_use_touch_bus ? bus_name[0] : bus_name[1],
               (unsigned int)s_shield_sht_addr);
    }

    for (uint32_t bi = 0u; bi < 2u; bi++)
    {
        for (uint32_t i = 0u; i < (sizeof(stts_addrs) / sizeof(stts_addrs[0])); i++)
        {
            if (!ShieldBusRead(buses[bi], stts_addrs[i], SHIELD_STTS22H_REG_WHO_AM_I, &who, 1u))
            {
                continue;
            }
            if ((who == SHIELD_STTS22H_WHOAMI) || ((who != 0x00u) && (who != 0xFFu)))
            {
                s_shield_stts_addr = stts_addrs[i];
                s_shield_stts_use_touch_bus = buses[bi];
                break;
            }
        }
        if (s_shield_stts_addr != 0u)
        {
            break;
        }
    }
    if ((s_shield_stts_addr == 0u) && s_shield_gyro_ready && (s_shield_gyro_who == SHIELD_IMU_WHOAMI_LSM6DSO16IS))
    {
        for (uint32_t i = 0u; i < (sizeof(stts_addrs) / sizeof(stts_addrs[0])); i++)
        {
            if (!ShieldShubReadRegs(stts_addrs[i], SHIELD_STTS22H_REG_WHO_AM_I, &who, 1u))
            {
                continue;
            }
            if ((who == SHIELD_STTS22H_WHOAMI) || ((who != 0x00u) && (who != 0xFFu)))
            {
                s_shield_stts_addr = stts_addrs[i];
                s_shield_stts_use_shub = true;
                break;
            }
        }
    }

